org-trello.org
#+title: Literate org-trello
#+author: Antoine R. Dumont

To help improving the maintenance of [[http://ardumont.github.io/org-trello/][org-trello]], we will describe it using [[https://en.wikipedia.org/wiki/Literate_programming][literate programming]].
For this, we will use [[http://orgmode.org/][org-mode]] and [[http://orgmode.org/worg/org-contrib/babel/intro.html][babel]].

We'll begin by:
- a simple how to
- a little description
- the license
- a manual
- a full description step-by-step of the code (may need to find another organisation that the code order)

* Howto
- Open this file
- Tangle (extract) the code

/M-x org-babel-tangle/ or /C-c C-v t/

Or

``` sh
make tangle
```

* Description
org-trello is an emacs's org minor mode to permit the 2-way synchonization between org buffer and a trello board.
The headers needs to start with ;;; as a prerequisite for packaging.
This is an important step where we describe the different information about the project:
- principal author
- maintainer
- current version
- dependencies

#+name: headers-description
#+begin_src lisp :cache yes
;;; org-trello.el --- Org minor mode to synchronize with trello

;; Copyright (C) 2013 Antoine R. Dumont <eniotna.t AT gmail.com>

;; Author: Antoine R. Dumont <eniotna.t AT gmail.com>
;; Maintainer: Antoine R. Dumont <eniotna.t AT gmail.com>
;; Version: 0.1.1
;; Package-Requires: ((org "8.0.7") (dash "1.5.0") (request "0.2.0") (cl-lib "0.3.0") (json "1.2"))
;; Keywords: org-mode trello sync org-trello
;; URL: https://github.com/ardumont/org-trello

#+end_src

* License
First, org-trello is a free software under the GPL v3.

#+name: headers-license
#+begin_src lisp :cache yes
;; This file is NOT part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.
;;
;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs; see the file COPYING. If not, write to the
;; Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
;; Boston, MA 02110-1301, USA.

#+end_src

* Manual
A fast setup that we, end-users, can see from the package installation procedure.

#+name: headers-manual
#+begin_src lisp :cache yes
;;; Commentary:

;; Minor mode for org-mode to sync org-mode and trello
;;
;; 1) Add the following to your emacs init file
;; (require 'org-trello)
;;
;; Automatically
;; 2) Once - Install the consumer-key and the read-write token for org-trello to be able to work in your name with your trello boards (C-c o i)
;; M-x org-trello/install-key-and-token
;;
;; 3) Once per org-mode file/board you want to connect to (C-c o I)
;; M-x org-trello/install-board-and-lists-ids
;;
;; *Beware* you must setup your trello board with the name you use as keywords (TODO, DONE e.g) on your org-mode file.
;;
;; 4) You can also create a board directly from a org-mode buffer (C-c o b)
;; M-x org-trello/create-board
;;

#+end_src
* Code
** Setup
First, we will begin simply by showing the dependencies.
Then the personal setup that the user can override.

*** Library dependencies
We depend on:

|------------+------------------------------------------------|
| lib        | description                                    |
|------------+------------------------------------------------|
| org        | As org-trello is a org minor mode              |
| json       | The transit of data to trello's api is in json |
| dash       | To provide some specific lisp constructs       |
| request    | Awesome http client                            |
| cl-lib     | To provide some common-lisp functions          |
| parse-time | Some date time manipulation                    |
|------------+------------------------------------------------|

#+name: org-trello-lib-deps
#+begin_src lisp :cache yes
;;; Code:

(require 'org)
(require 'json)
(require 'dash)
(require 'request)
(eval-when-compile (require 'cl-lib))
(require 'parse-time)

#+end_src

