org-trello.org
*** Providing

Now that we defined all of our code, we need to provide the library we created.
Simplify using emacs's primitive /provide/.

#+name: org-trello-provide
#+begin_src lisp :cache yes
(provide 'org-trello)

;;; org-trello.el ends here
#+end_src
** orgtrello
This is the namespace in charge of the primitive functions that actually trigger the action. Those functions reflect the same action as we define earlier but without any controls first.
They are not to be called directly from the user.

*** Namespace setup

First, we'll begin by some setup variables that are actually used throughout the namespace:
- *TODO* representation of org's "TODO" keyword
- *DONE* representation of org's "DONE" keyword
- *BOARD-ID* will be the trello board's identifier for org-trello to know which board to use
- *BOARD-NAME* will be the trello board's name for the user to know to which board he/she works with
- *LIST-NAMES* is the keyword the user use with org in reverse order
- *HMAP-ID-NAME* is a map of those same keyword with a sequence identifier
- *CONFIG-DIR* is the org-trello's home folder
- *CONFIG-FILE* is the org-trello's setup file (for consumer-key and access-token)
- *consumer-key* is the user's consumer-key for trello
- *access-token* is the user's read/write access-token for trello
- *ORGTRELLO-MARKER* is a marker used by org-trello to know which entity it has synced. This is dependent on the *consumer-key*

The user does not have to touch anything on this.

#+name: orgtrello-setup-variable
#+begin_src lisp :cache yes


;; #################### orgtrello

;; Specific state - FIXME check if they do not already exist on org-mode to avoid potential collisions
(defvar *TODO* "TODO" "org-mode todo state")
(defvar *DONE* "DONE" "org-mode done state")

;; Properties key for the orgtrello headers #+PROPERTY board-id, etc...
(defvar *BOARD-ID* "board-id" "orgtrello property board-id entry")
(defvar *BOARD-NAME* "board-name" "orgtrello property board-name entry")

(defvar *LIST-NAMES*   nil "orgtrello property names of the different lists. This use the standard 'org-todo-keywords property from org-mode.")
(defvar *HMAP-ID-NAME* nil "orgtrello hash map containing for each id, the associated name (or org keyword).")

(defvar *CONFIG-DIR*  (concat (getenv "HOME") "/" ".trello"))
(defvar *CONFIG-FILE* (concat *CONFIG-DIR* "/config.el"))

(defvar *consumer-key*     nil "Id representing the user")
(defvar *access-token*     nil "Read/write Access token to use trello in the user's name ")
(defvar *ORGTRELLO-MARKER* nil "Marker used for syncing the data in trello")
(defvar *ORGTRELLO-MARKER-PREFIX* "orgtrello-marker" "Prefix for the org-trello Marker used for syncing the data in trello.")

#+end_src

*** Control/setup routines

Some control/setup important routines because they will permit or not to launch the main actions.

**** orgtrello/--setup-properties

This is an important routine in charge of loading the keywords the user want to use.
Note that this routine reverse the list of org keywords.
This is a trick to help create the list in trello in the right order (assuming the user defines in the right order his/her keywords, e.g /TODO DOING | DONE FAIL/)

#+name: orgtrello/--setup-properties
#+begin_src lisp :cache yes
(defun orgtrello/--setup-properties ()
  "Setup the properties according to the org-mode setup. Return :ok."
  (let* ((orgtrello/--list-keywords (nreverse (orgtrello/filtered-kwds)))
         (orgtrello/--hmap-id-name (cl-reduce
                                    (lambda (hmap name)
                                      (progn
                                        (puthash (assoc-default name org-file-properties) name hmap)
                                        hmap))
                                    orgtrello/--list-keywords
                                    :initial-value (make-hash-table :test 'equal))))
    (setq *LIST-NAMES*   orgtrello/--list-keywords)
    (setq *HMAP-ID-NAME* orgtrello/--hmap-id-name)
    :ok))

#+end_src

**** orgtrello/filtered-kwds

This is a function in charge of retrieving the specific keywords the user wants to use with trello.
This will map later as the list in trello and as keyword in emacs's org-mode buffer.

#+name: orgtrello/filtered-kwds
#+begin_src lisp :cache yes
(defun orgtrello/filtered-kwds ()
  "org keywords used (based on org-todo-keywords-1)."
  org-todo-keywords-1)

#+end_src


**** orgtrello/--control-encoding

A simple message to make the user aware he needs to use utf-8 encoding.

#+name: orgtrello/--control-encoding
#+begin_src lisp :cache yes
(defun orgtrello/--control-encoding ()
  "Use utf-8, otherwise, there will be trouble."
  (progn
    (message "Ensure you use utf-8 encoding for your org buffer.")
    :ok))

#+end_src

**** orgtrello/--control-properties

An important higher routine to ensure that the setup regarding the trello board is rightly setuped on the org buffer.
We simply ensure that we have the right amount of properties regarding the org keywords.
If all is ok, we return the :ok value, otherwise, we return an error message indicating the user what he must do.

#+name: orgtrello/--control-properties
#+begin_src lisp :cache yes
(defun orgtrello/--control-properties ()
  "org-trello needs the properties board-id and all list id from the trello board to be setuped on header property file. Returns :ok if everything is ok, or the error message if problems."
  (let ((orgtrello/--hmap-count   (hash-table-count *HMAP-ID-NAME*)))
    (if (and (assoc-default *BOARD-ID* org-file-properties)
             (= (length *LIST-NAMES*) orgtrello/--hmap-count))
        :ok
      "Setup problem.\nEither you did not connect your org-mode buffer with a trello board, to correct this:\n  * attach to a board through C-c o I or M-x org-trello/install-board-and-lists-ids\n  * or create a board from scratch with C-c o b or M-x org-trello/create-board).\nEither your org-mode's todo keyword list and your trello board lists are not named the same way (which they must).\nFor this, connect to trello and rename your board's list according to your org-mode's todo list.\nAlso, you can specify on your org-mode buffer the todo list you want to work with, for example: #+TODO: TODO DOING | DONE FAIL (hit C-c C-c to refresh the setup)")))

#+end_src

**** orgtrello/--control-keys

Another important check routine to ensure that the user has rightfully setuped his/her consumer-key and read/write access-token.
If everything is ok, we return :ok.
Otherwise, we return an error message indicating what the user must do.

#+name: orgtrello/--control-keys
#+begin_src lisp :cache yes
(defun orgtrello/--control-keys ()
  "org-trello needs the *consumer-key* and the *access-token* to access the trello resources. Returns :ok if everything is ok, or the error message if problems."
  (if (or (and *consumer-key* *access-token* *ORGTRELLO-MARKER*)
          ;; the data are not set,
          (and (file-exists-p *CONFIG-FILE*)
               ;; trying to load them
               (load *CONFIG-FILE*)
               ;; still not loaded, something is not right!
               (and *consumer-key* *access-token* *ORGTRELLO-MARKER*)))
      :ok
    "Setup problem - You need to install the consumer-key and the read/write access-token - C-c o i or M-x org-trello/install-board-and-lists-ids"))

#+end_src

*** Abstraction access routines

Those are simple routines to abstract away the representation of the org data we manipulate.

**** orgtrello/--keyword

Extract the status/keyword from the current entity (e.g TODO, DONE, etc...).

#+name: orgtrello/--keyword
#+begin_src lisp :cache yes
(defun orgtrello/--keyword (entity-meta &optional default-value)
  "Retrieve the keyword from the entity. If default-value is specified, this is the default value if no keyword is present"
  (gethash :keyword entity-meta default-value))

#+end_src

**** orgtrello/--label

To extract the label from the entity.
This is what's map to the name of the entity on trello.

#+name: orgtrello/--label
#+begin_src lisp :cache yes
(defun orgtrello/--label (entity-meta)
  "Retrieve the label from the entity."
  (gethash :title entity-meta))

#+end_src

**** orgtrello/--id

The identifier of the entity once it has been synchronized on trello.

#+name: orgtrello/--id
#+begin_src lisp :cache yes
(defun orgtrello/--id (entity-meta)
  "Retrieve the id from the entity."
  (gethash :id entity-meta))

#+end_src

**** orgtrello/--level

The current level (mapped to the number of stars).

#+name: orgtrello/--level
#+begin_src lisp :cache yes
(defun orgtrello/--level (entity-meta)
  "Retrieve the level from the entity."
  (gethash :level entity-meta))

#+end_src

**** orgtrello/--due

The deadline (org notion) mapped to due date (on trello).

#+name: orgtrello/--due
#+begin_src lisp :cache yes
(defun orgtrello/--due (entity-meta)
  "Retrieve the due date from the entity."
  (gethash :due entity-meta))

#+end_src

*** Create simple entity
**** orgtrello/do-create-simple-entity

The orchestration to trigger the simple synchronization of an entity (without any arborescence):
- compute the metadata (current, parent, grandparent) from the current org entry (this may be need if too deep level)
- if there is some metadata
  - if this is an error message, transit the message
  - otherwise
    - set the marker on org buffer for the current entry
    - compute and execute the http query
    - return a success message

#+name: orgtrello/do-create-simple-entity
#+begin_src lisp :cache yes
(defun orgtrello/do-create-simple-entity (&optional sync)
  "Do the actual simple creation of a card, checklist or task. Optionally, we can render the creation synchronous."
  (let ((entry-metadata (orgtrello-data/entry-get-full-metadata)))
    (if entry-metadata
        (let ((query-http-or-error-msg (orgtrello/--dispatch-create (gethash :current entry-metadata) (gethash :parent entry-metadata) (gethash :grandparent entry-metadata))))
          (if (hash-table-p query-http-or-error-msg)
              ;; if it's a hash-table we can do the sync
              (progn
                ;; set the consumer-key to make a pointer to get back to when the request is finished
                (orgtrello/--set-marker)
                ;; request
                (orgtrello-query/http query-http-or-error-msg sync 'orgtrello-query/--post-put-success-callback-update-id)
                "Synchronizing simple entity done!")
            ;; else it's a string to display
            query-http-or-error-msg)))))

#+end_src

**** creation/update routine

Those functions does not actually do any request, they compute the map representing the request.
***** card
