org-trello.org
****** orgtrello/--card

This is the main entry to create/update a card.
There is a series of check done by the =orgtrello/--checks-before-sync-card= function.
If ok, then we can continue with the main intent of the function.
We extract from the metadata the:
- keyword status of the card (TODO, DONE, etc...)
- trello list identifier to which the card belongs to (depending on the keyword status)
- card's identifier
- card's name
- card's due

Then we create or update the card depending on the presence or not of the card identifier.
if card id present update else create.

#+name: orgtrello/--card
#+begin_src lisp :cache yes
(defun orgtrello/--card (card-meta &optional parent-meta grandparent-meta)
  "Deal with create/update card query build. If the checks are ko, the error message is returned."
  (let ((checks-ok-or-error-message (orgtrello/--checks-before-sync-card card-meta)))
    ;; title is mandatory
    (if (equal :ok checks-ok-or-error-message)
        ;; parent and grandparent are useless here
        (let* ((orgtrello/--card-kwd  (orgtrello/--retrieve-state-of-card card-meta))
               (orgtrello/--list-id   (assoc-default orgtrello/--card-kwd org-file-properties))
               (orgtrello/--card-id   (orgtrello/--id    card-meta))
               (orgtrello/--card-name (orgtrello/--label card-meta))
               (orgtrello/--card-due  (orgtrello/--due   card-meta)))
          (if orgtrello/--card-id
              ;; update
              (orgtrello-api/move-card orgtrello/--card-id orgtrello/--list-id orgtrello/--card-name orgtrello/--card-due)
            ;; create
            (orgtrello-api/add-card orgtrello/--card-name orgtrello/--list-id orgtrello/--card-due)))
      checks-ok-or-error-message)))

#+end_src
****** orgtrello/--retrieve-state-of-card

This function helps computes the status of the card.
If no status is present, TODO is assumed.

#+name: orgtrello/--retrieve-state-of-card
#+begin_src lisp :cache yes
(defun orgtrello/--retrieve-state-of-card (card-meta)
  "Given a card, retrieve its state depending on its :keyword metadata. If empty or no keyword then, its equivalence is *TODO*, otherwise, return its current state."
  (let* ((orgtrello/--card-kwd (orgtrello/--keyword card-meta *TODO*)))
    (if orgtrello/--card-kwd orgtrello/--card-kwd *TODO*)))

#+end_src

****** orgtrello/--checks-before-sync-card

Does some basic checks. Typically, here only the name/title/label is mandatory.

#+name: orgtrello/--checks-before-sync-card
#+begin_src lisp :cache yes
(defun orgtrello/--checks-before-sync-card (card-meta)
  "Checks done before synchronizing the cards."
  (let ((orgtrello/--card-name (orgtrello/--label card-meta)))
    (if orgtrello/--card-name
        :ok
      "Cannot synchronize the card - missing mandatory label. Skip it...")))

#+end_src

***** checklist
****** orgtrello/--checklist

The idea is similar than the card function.
First, checks using /orgtrello/--checks-before-sync-checklist/ function.
If ok, continue otherwise return the error message.
Then extract the needed metadata:
- checklist identifier (optional)
- card identifier (mandatory, a checklist belongs to a card)
- checklist name (mandatory)
Again, if checklist identifier present, we update otherwise we create.

#+name: orgtrello/--checklist
#+begin_src lisp :cache yes
(defun orgtrello/--checklist (checklist-meta &optional card-meta grandparent-meta)
  "Deal with create/update checklist query build. If the checks are ko, the error message is returned."
  (let ((checks-ok-or-error-message (orgtrello/--checks-before-sync-checklist checklist-meta card-meta)))
    ;; title is mandatory
    (if (equal :ok checks-ok-or-error-message)
        ;; grandparent is useless here
        (let* ((orgtrello/--checklist-id   (orgtrello/--id checklist-meta))
               (orgtrello/--card-id        (orgtrello/--id card-meta))
               (orgtrello/--checklist-name (orgtrello/--label checklist-meta)))
          (if orgtrello/--checklist-id
              ;; update
              (orgtrello-api/update-checklist orgtrello/--checklist-id orgtrello/--checklist-name)
            ;; create
            (orgtrello-api/add-checklist orgtrello/--card-id orgtrello/--checklist-name)))
      checks-ok-or-error-message)))

#+end_src
****** orgtrello/--checks-before-sync-checklist

A little more complex check are done.
We need to ensure:
- the card's id is present
- the checklist's name is present too.
If some are missing, send the error message corresponding.

#+name: orgtrello/--checks-before-sync-checklist
#+begin_src lisp :cache yes
(defun orgtrello/--checks-before-sync-checklist (checklist-meta card-meta)
  "Checks done before synchronizing the checklist."
  (let ((orgtrello/--checklist-name (orgtrello/--label checklist-meta))
        (orgtrello/--card-id        (orgtrello/--id card-meta)))
    (if orgtrello/--checklist-name
        (if orgtrello/--card-id
            :ok
          "Cannot synchronize the checklist - the card must be synchronized first. Skip it...")
      "Cannot synchronize the checklist - missing mandatory label. Skip it...")))

#+end_src

***** task/item
****** orgtrello/--task

Update the task/item.
First checks.
If ok, continue otherwise return the error message.
Metadata extracted:
- task/item's id (optional)
- checklist's id (mandatory)
- card's id (mandatory)
- task/item's name (mandatory)
- checklist's state (trello api distinguish between the state at update time from the check status at creation time)
- checklist's check status

Depending on the presence of the task/item's identifier, we update or create.

#+name: orgtrello/--task
#+begin_src lisp :cache yes
(defun orgtrello/--task (task-meta &optional checklist-meta card-meta)
  "Deal with create/update task query build. If the checks are ko, the error message is returned."
  (let ((checks-ok-or-error-message (orgtrello/--checks-before-sync-item task-meta checklist-meta card-meta)))
    ;; title is mandatory
    (if (equal :ok checks-ok-or-error-message)
        ;; card-meta is only usefull for the update part
        (let* ((orgtrello/--task-id      (orgtrello/--id task-meta))
               (orgtrello/--checklist-id (orgtrello/--id checklist-meta))
               (orgtrello/--card-id      (orgtrello/--id card-meta))
               (orgtrello/--task-name    (orgtrello/--label task-meta))
               (orgtrello/--task-state   (orgtrello/--keyword task-meta))
               (orgtrello/--checklist-state    (orgtrello/--keyword checklist-meta)))

          (orgtrello/--update-item-according-to-checklist-status *ORGTRELLO-CHECKLIST-UPDATE-ITEMS* checklist-meta)
          ;; update/create items
          (if orgtrello/--task-id
              ;; update - rename, check or uncheck the task
              (orgtrello-api/update-task orgtrello/--card-id orgtrello/--checklist-id orgtrello/--task-id orgtrello/--task-name (orgtrello/--task-compute-state *ORGTRELLO-CHECKLIST-UPDATE-ITEMS* orgtrello/--task-state orgtrello/--checklist-state))
            ;; create
            (orgtrello-api/add-tasks orgtrello/--checklist-id orgtrello/--task-name (orgtrello/--task-compute-check *ORGTRELLO-CHECKLIST-UPDATE-ITEMS* orgtrello/--task-state orgtrello/--checklist-state))))
      checks-ok-or-error-message)))

#+end_src

Also, there is a sublety.
*ORGTRELLO-CHECKLIST-UPDATE-ITEMS* is a global setup that permits the override of the task/item's status (checked or not).
if *ORGTRELLO-CHECKLIST-UPDATE-ITEMS* is set to 't, this will override such setup.
Otherwise, the item's status is computed depending on org's keyword.
This means that if *ORGTRELLO-CHECKLIST-UPDATE-ITEMS* is 't, we need to update the buffer accordingly to such status since this will be synchronized on trello.
That's the responsibility of the function /orgtrello/--update-item-according-to-checklist-status/.

****** orgtrello/--checks-before-sync-item

The control function which ensures:
- task/item's id
- checklist's id
- card's id
are presents.
If some are missing, the corresponding error message is sent, :ok otherwise.

#+name: orgtrello/--checks-before-sync-item
#+begin_src lisp :cache yes
(defun orgtrello/--checks-before-sync-item (task-meta checklist-meta card-meta)
  "Checks done before synchronizing the checklist."
  (let ((orgtrello/--task-name    (orgtrello/--label task-meta))
        (orgtrello/--checklist-id (orgtrello/--id checklist-meta))
        (orgtrello/--card-id      (orgtrello/--id card-meta)))
    (if orgtrello/--task-name
        (if orgtrello/--checklist-id
            (if orgtrello/--card-id
                :ok
              "Cannot synchronize the item - the card must be synchronized first. Skip it...")
          "Cannot synchronize the item - the checklist must be synchronized first. Skip it...")
      "Cannot synchronize the item - missing mandatory label. Skip it...")))

#+end_src

****** orgtrello/--task-compute-state-or-check
An HOF (higher order function) that captures the computation of the state (update) or the check (create) of an item/task.
#+name: orgtrello/--task-compute-state-or-check
#+begin_src lisp :cache yes
(defun orgtrello/--task-compute-state-or-check (checklist-update-items-p task-state checklist-state possible-states)
  "Compute the task's state/check (for creation/update). The 2 possible states are in the list possible states, first position is the 'checked' one, and second the unchecked one."
  (let* ((orgtrello/--task-checked   (first possible-states))
         (orgtrello/--task-unchecked (second possible-states)))
    (cond ((and checklist-update-items-p (string= *DONE* checklist-state))                      orgtrello/--task-checked)
          ((and checklist-update-items-p (or checklist-state (string= *TODO* checklist-state))) orgtrello/--task-unchecked)
          ((string= *DONE* task-state)                                                          orgtrello/--task-checked)
          (t                                                                                    orgtrello/--task-unchecked))))

#+end_src

