org-trello.org
**** orgtrello/do-sync-full-from-trello

Main function:
- retrieve the board id from the org metadata
- compute the cards from the trello board
- synchronize all the entities present on the buffer with the data from trello (remove them as soon as they are synced)
- synchronize all the remaining entities into the current buffer
- return a successfull message

#+name: orgtrello/do-sync-full-from-trello
#+begin_src lisp :cache yes
(defun orgtrello/do-sync-full-from-trello ()
  "Full org-mode file synchronisation. Beware, this will block emacs as the request is synchronous."
  (let ((orgtrello/--board-name-to-sync (orgtrello/--board-name)))
    (message "Synchronizing the trello board '%s' to the org-mode file. This may take a moment, some coffee may be a good idea..." orgtrello/--board-name-to-sync)
    (let* ((orgtrello/--board-id           (assoc-default *BOARD-ID* org-file-properties))
           (orgtrello/--cards              (orgtrello-query/http (orgtrello-api/get-cards orgtrello/--board-id) t))
           (orgtrello/--entities-hash-map  (orgtrello/--compute-full-entities-from-trello orgtrello/--cards))
           (orgtrello/--remaining-entities (orgtrello/--sync-buffer-with-trello-data orgtrello/--entities-hash-map)))
      (orgtrello/--update-buffer-with-remaining-trello-data orgtrello/--remaining-entities))
    (format "Synchronizing the trello board '%s' to the org-mode file - done!" orgtrello/--board-name-to-sync)))

#+end_src

**** orgtrello/--sync-buffer-with-trello-data

Given a map of entities to sync, update each entry with such data.
After each entry update, the entity is removed.
Return the map of entities with the sync entry removed.

#+name: orgtrello/--sync-buffer-with-trello-data
#+begin_src lisp :cache yes
(defun orgtrello/--sync-buffer-with-trello-data (entities)
  "Given all the entities, update the current buffer with those."
  (with-current-buffer (current-buffer)
    (org-map-entries
     (lambda ()
       (let ((entry-metadata (orgtrello-data/entry-get-full-metadata)))
         (if entry-metadata ;; if level > 4, entry-metadata is not considered as this is not represented in trello board
             ;; will search 'entities' hash table for updates (do not compute diffs, take them as is)
             (let* ((orgtrello/--entity         (gethash :current entry-metadata))
                    (orgtrello/--entity-id      (orgtrello/--id orgtrello/--entity))
                    (orgtrello/--entity-updated (gethash orgtrello/--entity-id entities)))
               (if orgtrello/--entity-updated
                   ;; found something, we update by squashing the current contents
                   (let* ((orgtrello/--entry-new-id    (orgtrello-query/--id   orgtrello/--entity-updated))
                          (orgtrello/--entity-due-date (orgtrello-query/--due  orgtrello/--entity-updated))
                          (orgtrello/--entry-new-name  (orgtrello-query/--name orgtrello/--entity-updated)))
                     ;; update the buffer with the new updates (there may be none but naively we will overwrite at the moment)
                     (message "Synchronizing entity '%s' with id '%s'..." orgtrello/--entry-new-name orgtrello/--entry-new-id)
                     (org-show-entry)
                     (kill-whole-line)
                     (if orgtrello/--entity-due-date (kill-whole-line))
                     (insert (orgtrello/--compute-entity-to-org-entry orgtrello/--entity-updated))
                     ;; remove the entry from the hash-table
                     (remhash orgtrello/--entity-id entities)))))))
     t
     'file))
  ;; return the entities which has been dryed
  entities)

#+end_src

**** orgtrello/--update-buffer-with-remaining-trello-data

Given a map of entities:
- goes at the end of the file
- add the entities present on such map in the org format
- return at the beginning of the file
- sort all the buffer on the org todo keywords order (only the first level -> card).

#+name: orgtrello/--update-buffer-with-remaining-trello-data
#+begin_src lisp :cache yes
(defun orgtrello/--update-buffer-with-remaining-trello-data (entities)
  "Given a map of entities, dump those entities in the current buffer."
  (if entities ;; could be empty
      (with-current-buffer (current-buffer)
        ;; go at the end of the file
        (goto-char (point-max))
        ;; dump the remaining entities
        (maphash
         (lambda (orgtrello/--entry-new-id orgtrello/--entity)
           (let ((orgtrello/--entry-new-name  (orgtrello-query/--name orgtrello/--entity)))
             (message "Synchronizing new entity '%s' with id '%s'..." orgtrello/--entry-new-name orgtrello/--entry-new-id)
             (insert (orgtrello/--compute-entity-to-org-entry orgtrello/--entity))
             (org-set-property *ORGTRELLO-ID* orgtrello/--entry-new-id)))
         entities)
        (goto-char (point-min))
        (org-sort-entries t ?o))))

#+end_src

**** orgtrello/--compute-card-status

Given a card list id (which represent an org keyword), compute the keywords (this works with the metadata of the file).

#+name: orgtrello/--compute-card-status
#+begin_src lisp :cache yes
(defun orgtrello/--compute-card-status (card-id-list)
  "Given a card's id, compute its status."
  (gethash card-id-list *HMAP-ID-NAME*))

#+end_src

**** orgtrello/--compute-card-to-org-entry

Given an entry which represents a card, compute its equivalent org format.

#+name: orgtrello/--compute-card-to-org-entry
#+begin_src lisp :cache yes
(defun orgtrello/--compute-card-to-org-entry (card)
  "Given a card, compute its org-mode entry equivalence."
  (let* ((orgtrello/--card-name     (orgtrello-query/--name card))
         (orgtrello/--card-status   (orgtrello/--compute-card-status (orgtrello-query/--list-id card)))
         (orgtrello/--card-due-date (orgtrello-query/--due card)))
    (format "* %s %s\n%s" orgtrello/--card-status orgtrello/--card-name
            (if orgtrello/--card-due-date (format "DEADLINE: <%s>\n" orgtrello/--card-due-date) ""))))

#+end_src

**** orgtrello/--compute-checklist-to-org-entry

Given an entry which represents a checklist, compute its equivalent org format.

#+name: orgtrello/--compute-checklist-to-org-entry
#+begin_src lisp :cache yes
(defun orgtrello/--compute-checklist-to-org-entry (checklist)
  "Given a checklist, compute its org-mode entry equivalence."
  (let ((orgtrello/--checklist-name  (orgtrello-query/--name checklist)))
    (format "** %s\n" orgtrello/--checklist-name)))

#+end_src

**** orgtrello/--compute-item-to-org-entry

Given an entry which represents an item/task, compute its equivalent org format.

#+name: orgtrello/--compute-item-to-org-entry
#+begin_src lisp :cache yes
(defun orgtrello/--compute-item-to-org-entry (item)
  "Given a checklist item, compute its org-mode entry equivalence."
  (let* ((orgtrello/--item-name  (orgtrello-query/--name  item))
         (orgtrello/--item-state (orgtrello-query/--state item)))
    (format "*** %s %s\n"
            (if (string= "complete" orgtrello/--item-state) *DONE* *TODO*)
            orgtrello/--item-name)))

#+end_src

**** orgtrello/--compute-entity-to-org-entry

Given an entry, determine according to its structure the nature of such entity:
- list-id, it's a card
- card-id, it's a checklist
- state, it's an item/task

#+name: orgtrello/--compute-entity-to-org-entry
#+begin_src lisp :cache yes
(defun orgtrello/--compute-entity-to-org-entry (entity)
  "Given an entity, compute its org representation."
  (cond ((orgtrello-query/--list-id entity) (orgtrello/--compute-card-to-org-entry entity))           ;; card      (level 1)
        ((orgtrello-query/--card-id entity) (orgtrello/--compute-checklist-to-org-entry entity))      ;; checklist (level 2)
        ((orgtrello-query/--state entity)  (orgtrello/--compute-item-to-org-entry entity))))          ;; items     (level 3)

#+end_src

**** orgtrello/--do-retrieve-checklists-from-card

Given a card, retrieve its full checklist and return a list composed of the card cons'ed to such entities.

#+name: orgtrello/--do-retrieve-checklists-from-card
#+begin_src lisp :cache yes
(defun orgtrello/--do-retrieve-checklists-from-card (card)
  "Given a card, return the list containing the card, the checklists from this card, and the items from the checklists. The order is guaranted."
  (cl-reduce
   (lambda (acc-list checklist-id)
     (let ((orgtrello/--checklist (orgtrello-query/http (orgtrello-api/get-checklist checklist-id) t)))
       (append (cons orgtrello/--checklist (orgtrello/--do-retrieve-checklists-and-items orgtrello/--checklist)) acc-list)))
   (orgtrello-query/--checklist-ids card)
   :initial-value nil))

#+end_src

**** orgtrello/--do-retrieve-checklists-and-items

Given a checklist, retrieve its full items/tasks and return a list composed of the checklist cons'ed to such entities.

#+name: orgtrello/--do-retrieve-checklists-and-items
#+begin_src lisp :cache yes
(defun orgtrello/--do-retrieve-checklists-and-items (checklist)
  "Given a checklist id, retrieve all the items from the checklist and return a list containing first the checklist, then the items."
  (--map it (orgtrello-query/--check-items checklist)))

#+end_src

