org-trello.org
**** orgtrello/do-install-board-and-lists

Main routine to ask for the user's input to setup his/her board to attach to his/her current org buffer.
This:
- generates a list of his/her current board from his/her trello's account.
- ask for the user to input which board he/she wants to use
- then generate the metadata regarding his/her choice to the org buffer's beginning
- return a message of success

#+name: orgtrello/do-install-board-and-lists
#+begin_src lisp :cache yes
(defun orgtrello/do-install-board-and-lists ()
  "Interactive command to install the list boards"
  (interactive)
  (cl-destructuring-bind
      (orgtrello/--chosen-board-id orgtrello/--chosen-board-name) (-> (orgtrello/--list-boards)
                                                                      orgtrello/--id-name
                                                                      orgtrello/--choose-board)
    (let ((orgtrello/--board-lists-hname-id (-> orgtrello/--chosen-board-id
                                                orgtrello/--list-board-lists
                                                orgtrello/--name-id)))
      ;; remove any eventual present entry
      (orgtrello/--remove-properties-file orgtrello/--board-lists-hname-id t)
      ;; update with new ones
      (orgtrello/update-orgmode-file-with-properties
       orgtrello/--chosen-board-name
       orgtrello/--chosen-board-id
       orgtrello/--board-lists-hname-id
       t)))
  "Install board and list ids done!")

#+end_src

**** orgtrello/--choose-board

The routine that asks the user:
- to select the board he/she wants to work with
- return the list of board id, board name

#+name: orgtrello/--choose-board
#+begin_src lisp :cache yes
(defun orgtrello/--choose-board (boards)
  "Given a map of boards, display the possible boards for the user to choose which one he wants to work with."
  ;; ugliest ever
  (defvar orgtrello/--board-chosen nil)
  (setq orgtrello/--board-chosen nil)
  (let* ((str-key-val  "")
         (i            0)
         (i-id (make-hash-table :test 'equal)))
    (maphash (lambda (id name)
               (setq str-key-val (format "%s%d: %s\n" str-key-val i name))
               (puthash (format "%d" i) id i-id)
               (setq i (+ 1 i)))
             boards)
    (while (not (gethash orgtrello/--board-chosen i-id))
      (setq orgtrello/--board-chosen
            (read-string (format "%s\nInput the number of the board desired: " str-key-val))))
    (let* ((orgtrello/--chosen-board-id   (gethash orgtrello/--board-chosen i-id))
           (orgtrello/--chosen-board-name (gethash orgtrello/--chosen-board-id boards)))
      `(,orgtrello/--chosen-board-id ,orgtrello/--chosen-board-name))))

#+end_src

**** orgtrello/--remove-properties-file

Remove some file properties before applying new ones.

#+name: orgtrello/--remove-properties-file
#+begin_src lisp :cache yes
(defun orgtrello/--delete-buffer-property (property-name)
  "A simple routine to delete a #+property: entry from the org-mode buffer."
  (let ((current-point (search-forward property-name nil t)))
    (if current-point
        (progn
          (goto-char current-point)
          (beginning-of-line)
          (kill-line)
          (kill-line)))))

(defun orgtrello/--remove-properties-file (board-lists-hash-name-id &optional update-todo-keywords)
  "Remove the current org-trello properties"
  (with-current-buffer (current-buffer)
    (goto-char (point-min))
    (orgtrello/--delete-buffer-property (format "#+property: %s" *BOARD-ID*))
    (orgtrello/--delete-buffer-property (format "#+property: %s" *BOARD-NAME*))
    (maphash
     (lambda (name id)
       (orgtrello/--delete-buffer-property (format "#+property: %s" (orgtrello/convention-property-name name))))
     board-lists-hash-name-id)
    (if update-todo-keywords
        (orgtrello/--delete-buffer-property "#+TODO: "))))

#+end_src

**** orgtrello/update-orgmode-file-with-properties

Given a board name, board id, list of list ids, map of list names, insert such informations to the beginning of the org buffer.
Then save the buffer and restart org-mode.

#+name: orgtrello/update-orgmode-file-with-properties
#+begin_src lisp :cache yes
(defun orgtrello/update-orgmode-file-with-properties (board-name board-id board-lists-hash-name-id &optional update-todo-keywords)
  "Update the orgmode file with the needed headers for org-trello to work."
  (with-current-buffer (current-buffer)
    (goto-char (point-min))
    ;; force utf-8
    (set-buffer-file-coding-system 'utf-8-auto)
    ;; install board-name and board-id
    (insert (format "#+property: %s    %s\n" *BOARD-NAME* board-name))
    (insert (format "#+property: %s      %s\n" *BOARD-ID* board-id))
    ;; install the other properties regarding the org keywords
    (maphash
     (lambda (name id)
       (insert (format "#+property: %s %s\n" (orgtrello/convention-property-name name) id)))
     board-lists-hash-name-id)
    (if update-todo-keywords
        (progn
          ;; install the todo list
          (insert "#+TODO: ")
          (maphash (lambda (name _) (insert (concat (orgtrello/convention-property-name name) " "))) board-lists-hash-name-id)
          (insert "\n")))
    ;; save the buffer
    (save-buffer)
    ;; restart org to make org-trello aware of the new setup
    (org-mode-restart)))

#+end_src

**** orgtrello/--id-name

Given a list of entities, return a map of (id . name)

#+name: orgtrello/--id-name
#+begin_src lisp :cache yes
(defun orgtrello/--id-name (entities)
  "Given a list of entities, return a map of (id, name)."
  (let* ((id-name (make-hash-table :test 'equal)))
    (mapc (lambda (it) (puthash (orgtrello-query/--id it) (orgtrello-query/--name it) id-name)) entities)
    id-name))

#+end_src

**** orgtrello/--name-id

Given a list of entities, return a map of (name . id)

#+name: orgtrello/--name-id
#+begin_src lisp :cache yes
(defun orgtrello/--name-id (entities)
  "Given a list of entities, return a map of (id, name)."
  (let* ((name-id (make-hash-table :test 'equal)))
    (mapc (lambda (it) (puthash (orgtrello-query/--name it) (orgtrello-query/--id it) name-id)) entities)
    name-id))

#+end_src

**** orgtrello/--list-boards

Execute the query that return a list of boards from the user's current trello account.

#+name: orgtrello/--list-boards
#+begin_src lisp :cache yes
(defun orgtrello/--list-boards ()
  "Return the map of the existing boards associated to the current account. (Synchronous request)"
  (cl-remove-if-not
   (lambda (board) (equal :json-false (orgtrello-query/--close-property board)))
   (orgtrello-query/http (orgtrello-api/get-boards) t)))

#+end_src

**** orgtrello/--list-board-lists

Execute the query that return a list of the board lists from the user's current trello account.

#+name: orgtrello/--list-board-lists
#+begin_src lisp :cache yes
(defun orgtrello/--list-board-lists (board-id)
  "Return the map of the existing list of the board with id board-id. (Synchronous request)"
  (orgtrello-query/http (orgtrello-api/get-lists board-id) t))

#+end_src

**** orgtrello/convention-property-name

A function to help eventually decorate the name of the keywords.
Replace the space by dash at the moment.

#+name: orgtrello/convention-property-name
#+begin_src lisp :cache yes
(defun orgtrello/convention-property-name (name)
  "Use the right convention for the property used in the headers of the org-mode file."
  (replace-regexp-in-string " " "-" name))

#+end_src

*** Create board
The main function regarding the creation of the board and the org attachment to such board.

**** orgtrello/do-create-board-and-lists

The main entry.
We will ask the user to:
- input the name of the board he/she wants.
- input an optional board description
Then launch the creation of the board.
This will:
- create the board
- close the default lists created by trello
- create as much list as the user's keywords with the same name as the corresponding keywords.
- at last, update the beginning of the org buffer with the corresponding metadata:
  - board-name
  - board-id
  - list-id for all lists created

#+name: orgtrello/do-create-board-and-lists
#+begin_src lisp :cache yes
(defun orgtrello/do-create-board-and-lists ()
  "Interactive command to create a board and the lists"
  (interactive)
  (defvar orgtrello/--board-name nil)        (setq orgtrello/--board-name nil)
  (defvar orgtrello/--board-description nil) (setq orgtrello/--board-description nil)
  (while (not orgtrello/--board-name) (setq orgtrello/--board-name (read-string "Please, input the desired board name: ")))
  (setq orgtrello/--board-description (read-string "Please, input the board description (empty for none): "))
  (cl-destructuring-bind (orgtrello/--board-id orgtrello/--board-name) (orgtrello/--create-board orgtrello/--board-name orgtrello/--board-description)
                         (let* ((orgtrello/--board-list-ids       (--map (orgtrello-query/--id it) (orgtrello/--list-board-lists orgtrello/--board-id)))  ;; first retrieve the existing lists (created by default on trello)
                                (orgtrello/--lists-to-close       (orgtrello/--close-lists orgtrello/--board-list-ids))                                ;; close those lists (they may surely not match the name we want)
                                (orgtrello/--board-lists-hname-id (orgtrello/--create-lists-according-to-keywords orgtrello/--board-id *LIST-NAMES*))) ;; create the list, this returns the ids list
                           ;; remove eventual already present entry
                           (orgtrello/--remove-properties-file orgtrello/--board-lists-hname-id)
                           ;; update org buffer with new ones
                           (orgtrello/update-orgmode-file-with-properties orgtrello/--board-name orgtrello/--board-id orgtrello/--board-lists-hname-id)))
  "Create board and lists done!")

(message "org-trello - orgtrello loaded!")

#+end_src
**** orgtrello/--create-board

The actual board creation.
This return a list of board id, board name.

#+name: orgtrello/--create-board
#+begin_src lisp :cache yes
(defun orgtrello/--create-board (board-name &optional board-description)
  "Create a board with name and eventually a description."
  (progn
    (message "Creating board '%s'" board-name)
    (let* ((board-data (orgtrello-query/http (orgtrello-api/add-board board-name board-description) t)))
      (list (orgtrello-query/--id board-data) (orgtrello-query/--name board-data)))))

#+end_src

**** orgtrello/--close-lists

The close list routine.
Given a list of list ids, close each of those list.

#+name: orgtrello/--close-lists
#+begin_src lisp :cache yes
(defun orgtrello/--close-lists (list-ids)
  "Given a list of ids, close those lists."
  (mapc (lambda (list-id)
          (progn
            (message "Closing default list with id %s" list-id)
            (orgtrello-query/http (orgtrello-api/close-list list-id) nil nil 'simple-error-callback)))
        list-ids))

#+end_src

